class Regulator {
	constructor() {
		this.conversionTable = {
			ー: "",
			あ: "あ", ぁ: "あ",
			い: "い", ぃ: "い",
			う: "う", ゔ: "う", ぅ: "う",
			え: "え", ぇ: "え",
			お: "お", ぉ: "お",
			か: "か", が: "か", ゕ: "か",
			き: "き", ぎ: "き",
			く: "く", ぐ: "く",
			け: "け", げ: "け", ゖ: "け",
			こ: "こ", ご: "こ",
			さ: "さ", ざ: "さ",
			し: "し", じ: "し",
			す: "す", ず: "す",
			せ: "せ", ぜ: "せ",
			そ: "そ", ぞ: "そ",
			た: "た", だ: "た",
			ち: "ち", ぢ: "ち",
			つ: "つ", づ: "つ", っ: "つ",
			て: "て", で: "て",
			と: "と", ど: "と",
			な: "な", 
			に: "に",
			ぬ: "ぬ",
			ね: "ね",
			の: "の",
			は: "は", ば: "は", ぱ: "は",
			ひ: "ひ", び: "ひ", ぴ: "ひ",
			ふ: "ふ", ぶ: "ふ", ぷ: "ふ",
			へ: "へ", べ: "へ", ぺ: "へ",
			ほ: "ほ", ぼ: "ほ", ぽ: "ほ",
			ま: "ま",
			み: "み",
			む: "む",
			め: "め",
			も: "も",
			や: "や", ゃ: "や",
			ゆ: "ゆ", ゅ: "ゆ",
			よ: "よ", ょ: "よ",
			ら: "ら",
			り: "り",
			る: "る",
			れ: "れ",
			ろ: "ろ",
			わ: "わ", ゎ: "わ",
			ゐ: "ゐ",
			ゑ: "ゑ",
			を: "を",
			ん: "ん",
		};
	}
	regulate(str) {
		let result = "";
		let ar = str.split("");
		for (let i = 0; i < ar.length; i++) {
			if (ar[i] in this.conversionTable) {
				result += this.conversionTable[ar[i]];
			}
		}
		return result;
	}
}	// end of Regulator class
